@echo off 
 
title now user
chcp 866 >nul
color 5





:menu 

echo. 
echo                          ÛÛÛÛÛÛ» ÛÛÛÛÛ» ÛÛÛÛÛÛ» ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»ÛÛ»   ÛÛ»ÛÛ»     ÛÛ»  ÛÛ»   ÛÛ»
echo                         ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÛÛ»ÛÛÉÍÍÛÛ»ÛÛÉÍÍÍÍ¼ÛÛÉÍÍÍÍ¼ÛÛº   ÛÛºÛÛº     ÛÛº  ÈÛÛ» ÛÛÉ¼
echo                         ÛÛº     ÛÛÛÛÛÛÛºÛÛÛÛÛÛÉ¼ÛÛÛÛÛ»  ÛÛÛÛÛ»  ÛÛº   ÛÛºÛÛº     ÛÛº   ÈÛÛÛÛÉ¼ 
echo                         ÛÛº     ÛÛÉÍÍÛÛºÛÛÉÍÍÛÛ»ÛÛÉÍÍ¼  ÛÛÉÍÍ¼  ÛÛº   ÛÛºÛÛº     ÛÛº    ÈÛÛÉ¼  
echo                         ÈÛÛÛÛÛÛ»ÛÛº  ÛÛºÛÛº  ÛÛºÛÛÛÛÛÛÛ»ÛÛº     ÈÛÛÛÛÛÛÉ¼ÛÛÛÛÛÛÛ»ÛÛÛÛÛÛÛ»ÛÛº   
echo                          ÈÍÍÍÍÍ¼ÈÍ¼  ÈÍ¼ÈÍ¼  ÈÍ¼ÈÍÍÍÍÍÍ¼ÈÍ¼      ÈÍÍÍÍÍ¼ ÈÍÍÍÍÍÍ¼ÈÍÍÍÍÍÍ¼ÈÍ¼  
echo.
echo [ [38;2;255;255;0m…á«¨ ¢ë ã¢¥à¥­ë â® ¢¥¤¨â¥  ³ user ³ :keyboard en_US [38;2;128;0;128m]

echo              º
echo              º
echo      [38;2;255;255;0minfo [38;2;128;0;128mÍÍÍ¹
echo              º
echo              [38;2;128;0;128mº  [38;2;255;255;0mnonnsweety
set /p input=.%BS%            [38;2;128;0;128mÈÍÍÍÍÍÍÍÍÍÍÍÍÍÍ[38;2;255;0;0m ^> 



if /I %input% EQU user start user.bat

if /I %input% EQU info start info_now_user.txt



cls
goto :menu 


























